Repository: alkatrazstudio/gpu-fan-meister
Catalog: docs/src/locale/*/LC_MESSAGES/user.po
Languages: ru

source: Command line parameters
ru: Параметры командной строки

source: |project| supports the following command line parameters:
ru: |project| поддерживает следующие параметры командной строки:

source: **--plugins** - allows you to specify a list of :doc:`plugins <plugins>`, which will be used to work with video cards. If the parameter is not set, the plugins that were last selected in the ":doc:`gui/enabledPlugins`" window will be used. The list of these plugins can be displayed through the :ref:`--enabled-plugins <cli-enabled-plugins>` parameter. If the parameter is omitted, and no plugins have been selected before, the ":doc:`gui/enabledPlugins`" window will appear.
ru: **--plugins** - позволяет задать список :doc:`плагинов <plugins>`, которые будут использоваться для работы с видеокартами. Если параметр не задан, то будут использоваться плагины, которые были последний раз выбраны в окне ":doc:`gui/enabledPlugins`". Вывести список этих плагинов можно через параметр :ref:`--enabled-plugins <cli-enabled-plugins>`. Если параметр опущен, и никакие плагины не были ранее выбраны, то покажется окно ":doc:`gui/enabledPlugins`".

source: **--available-plugins** - display the list of available installed :doc:`plugins <plugins>` one per line. It does not check whether these plugins can actually be loaded. For each plugin, its folder will also be displayed.
ru: **--available-plugins** - вывести список доступных установленных :doc:`плагинов <plugins>` по одному на строку. При этом не проверяется, могут ли эти плагины быть загружены на самом деле. Для каждого плагина будет также выведена его папка.

source: **--enabled-plugins** - display the list of :doc:`plugins <plugins>`, last selected in the ":doc:`gui/enabledPlugins`" window. In other words, these plugins will be loaded if you omit the :ref:`--plugins <cli-plugins>` parameter. For each plugin, its folder will also be displayed.
ru: **--enabled-plugins** - вывести список :doc:`плагинов <plugins>`, последний раз выбранных в окне ":doc:`gui/enabledPlugins`". Т.е., другими словами, эти плагины будут загружены, если опустить параметр :ref:`--plugins <cli-plugins>`. Для каждого плагина будет также выведена его папка.

source: **--plugin-selector** - show the ":doc:`gui/enabledPlugins`" window. After closing the window, the program will exit.
ru: **--plugin-selector** - показать окно ":doc:`gui/enabledPlugins`". После закрытия окна программа завершит работу.

source: **--html-help** - start the browser and open the full application manual (you are reading now).
ru: **--html-help** - запустить браузер и открыть в нём полную документацию программы (ту, что вы читаете сейчас).

source: **--dirs** - get a list of all :doc:`search folders <resources>`.
ru: **--dirs** - выдать список всех :doc:`папок для поиска <resources>`.

source: **--load-qml** - download all GUI files and then exit the program. This option is for internal use only.
ru: **--load-qml** - загрузить все файлы GUI, а потом выйти из программы. Этот параметр нужен исключительно для внутреннего использования.

source: **-v** or **--version** - show the name and version of the application.
ru: **-v** или **--version** - показать название программы и версию.

source: **-h** or **--help** - show help on command line parameters.
ru: **-h** или **--help** - показать справку по параметрам командной строки.

source: Download
ru: Загрузка

source: |project| can be downloaded from the official website: `<https://gpufanmeister.alkatrazstudio.net>`_. At the moment there is a build only for Linux. Also, the systems on Wayland are not supported.
ru: |project| можно скачать с официального сайта программы: `<https://gpufanmeister.alkatrazstudio.net>`_. На данный момент имеется сборка только для Linux. При этом, системы на Wayland не поддерживаются.

source: |project| is distributed in the `AppImage <https://appimage.org>`_ format as a single executable file, but this file is not fully self-contained. In particular, the `Python 3 interpreter <https://www.python.org>`_ and `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_ must be installed to run the program on Linux. These programs are usually already pre-installed on Desktop Linux. Also, each of the :doc:`plugins <plugins>` may have its own requirements to run. For example, the requirements for the **nvidia-nvml** plugin, which is included with |project|, are described on the :doc:`corresponding page <plugins/nvidia-nvml>`.
ru: |project| распространяется в формате `AppImage <https://appimage.org>`_ как один исполняемый файл, однако этот файл не является полностью самодостаточным. В частности, для запуска программы в Linux должен присутствовать интерпретатор `Python 3 <https://www.python.org>`_, а также `D-Bus <https://www.freedesktop.org/wiki/Software/dbus/>`_. Эти программы, как правило, уже предустановлены на Desktop Linux. Также, у каждого из :doc:`плагинов <plugins>` могут быть свои требования для запуска. Например, требования для плагина **nvidia-nvml**, который входит в состав |project|, описаны на :doc:`соответствующей странице <plugins/nvidia-nvml>`.

source: |project| is a free and open source project, so you can try to build it from source by following :doc:`build instructions </dev/build>`.
ru: |project| является свободным проектом с открытым исходным кодом, поэтому его можно попытаться собрать его из исходников, следуя :doc:`инструкциям по сборке </dev/build>`.

source: You can view the list of changes of |project| here: `<https://github.com/alkatrazstudio/gpu-fan-meister/blob/master/CHANGELOG.rst>`_.
ru: Вы можете просмотреть список изменений |project| здесь: `<https://github.com/alkatrazstudio/gpu-fan-meister/blob/master/CHANGELOG.rst>`_.

source: Application interface
ru: Интерфейс программы

source: The graphical interface of |project| consists of the following parts:
ru: Графический интерфейс |project| состоит из следующих частей:

source: :doc:`gui/trayIcon`. Each video card will have its own icon that contains a brief summary of its current state.
ru: :doc:`gui/trayIcon`. Для каждой видеокарты будет выделена отдельная иконка, содержащая краткую сводку текущего состояния.

source: :doc:`gui/mainWindow`. Selects and adjusts the desired :doc:`mode <modes>` for each video card. Can be opened by clicking on the tray icon of the corresponding video card.
ru: :doc:`gui/mainWindow`. Служит для выбора и настройки нужного :doc:`режима <modes>` для каждой видеокарты. Открывается кликом на иконку соответствующей видеокарты в трее.

source: :doc:`gui/devOptions`. Allows you to set different options for your graphics card. Available through the "Device options..." button in the main program window.
ru: :doc:`gui/devOptions`. Позволяет задать различные настройки для видеокарты. Доступно через кнопку "Настройки устройства..." в главном окне программы.

source: :doc:`gui/enabledPlugins`. Available through :ref:`main menu <gui-mainWindow-mainMenu>`: "Application" => "Settings...".
ru: :doc:`gui/enabledPlugins`. Доступно через пункт :ref:`главного меню <gui-mainWindow-mainMenu>` "Приложение" => "Настройки...".

source: Application settings window. Available through :ref:`main menu <gui-mainWindow-mainMenu>`: "Application" => "Select plugins...".
ru: Окно с настройками приложения. Доступно через пункт :ref:`главного меню <gui-mainWindow-mainMenu>` "Приложение" => "Выбрать плагины...".

source: Help windows with information about the application and components used. Available through :ref:`main menu <gui-mainWindow-mainMenu>` "Help" item.
ru: Справочные окна с информацией о приложении и используемых компонентах. Доступны через пункт :ref:`главного меню <gui-mainWindow-mainMenu>` "Справка".

source: Device options
ru: Настройки устройства

source: Clicking on the "Device options..." button in the lower left corner of the main application window will open a dialog where you can set the settings for the video card that is currently selected. The possible settings are listed below:
ru: Нажав на кнопку "Настройки устройства..." в левом нижнем углу главного окна программы, вам откроется диалоговое окно, где можно задать настройки для той видеокарты, которая выбрана в данный момент. Возможные настройки указаны ниже:

source: Display name
ru: Отображаемое название

source: Custom name for the video card. This name will be displayed everywhere in the interface, for example in the headings of windows, info messages, etc. If you leave this name blank, the interface will display the name of the video card, which was defined by :doc:`plugin </user/plugins>` that is responsible for interacting with this video card.
ru: Своё название для видеокарты. Это название будет отображаться везде в интерфейсе, например в заголовках окон, информационных сообщения и т. п. Если оставить это название пустым, то в интерфейсе будет отображаться то название видеокарты, которое было установлено :doc:`плагином </user/plugins>`, отвечающим за работу с видеокартой.

source: Tray icon colors
ru: Цвета иконки в трее

source: In this section you can set the colors that current temperature of the video card and the fan speed will be displayed in :doc:`tray <trayIcon>` . Here you can also set the background color of the tray icon. The color, which is to the right of the number, shows from which value this color will be applied. The color to the left of the number will be applied if the value of the corresponding indicator is less than this number.
ru: В данном разделе можно задать цвета, которыми будут отображаться в :doc:`трее <trayIcon>` текущие температура видеокарты и скорость вращения вентиляторов. Здесь же можно задать и цвет фона иконки. Цвет, который находится справа от числа, показывает начиная с какого значения будет применяться этот цвет. Цвет слева от числа будет применяться, если значение соответствующего показателя меньше этого числа.

source: *Example:*
ru: *Пример:*

source: For example, if the "Temperature" line has the following settings:
ru: Допустим, в строке "Температура" настройки прописаны следующим образом:

source: white - 60 - yellow - 75 - red
ru: белый - 60 - жёлтый - 75 - красный

source: Then this will mean that at temperatures between 0 and 59 °C inclusive, the color of the number displaying the current tray temperature of the video card will be white. At temperatures between 60 and 74 °C inclusive, the color will be yellow. If the temperature is 75 °C or higher, the color will be red.
ru: Это будет означать, что при температуре от 0 до 59 °C включительно цвет числа, отображающего текущую температуру видеокарты в трее, будет белым. При температуре от 60 до 74 °C включительно цвет будет жёлтым. Если температура будет 75 °C или больше, то цвет будет красным.

source: You can change the color by clicking on it. Transparency is supported.
ru: Поменять цвет можно, кликнув на него. Поддерживается прозрачность.

source: Update the tray icon every N seconds
ru: Обновлять иконку в трее каждые N секунд

source: The :doc:`tray icon <trayIcon>` will be updated no more than once in N seconds.
ru: Иконка в :doc:`трее <trayIcon>` будет обновляться не чаще, чем раз в N секунд.

source: In addition, the "Show/Hide plugin info" button will display or hide information about the :doc:`plugin </user/plugins>` that is currently working with the selected video card.
ru: Помимо этого, кнопка "Показать/спрятать сведения о плагине" отобразит или скроет информацию о :doc:`плагине </user/plugins>`, который в данный момент работает с выбранной видеокартой.

source: Enabled plugins
ru: Выбор плагинов

source: In this window you can choose :doc:`plugins </user/plugins>` that will be automatically loaded the next time you start the application.
ru: В данном окне можно выбрать :doc:`плагины </user/plugins>`, которые будут автоматом загружены при следующем запуске программы.

source: The window shows all installed plugins, regardless of whether they can actually be loaded into |project| or not. If a plugin cannot be loaded when you start the program, you will receive a system message with details.
ru: В окне показаны все установленные плагины, вне зависимости от того, могут ли они быть на самом деле подключены к |project| или нет. Если какой-то плагин не сможет быть загружен при запуске программы, то вам выдастся системное сообщение с подробностями.

source: You need to select at least one plugin to run the program. Some plugins can be mutually exclusive and cannot be loaded in parallel. For example, two different plugins for video cards of the same developer may conflict with each other.
ru: Для работы программы нужно выбрать хотя бы один плагин. Некоторые плагины могут быть взаимоисключающими и не могут быть загружены параллельно. Например, два разных плагина для видеокарт одного разработчика могут конфликтовать друг с другом.

source: You can open this window by doing one of the following:
ru: Данное окно можно открыть следующими способами:

source: Via :ref:`main menu <gui-mainWindow-mainMenu>`: **Application** => **Select plugins...**.
ru: Через :ref:`главное меню <gui-mainWindow-mainMenu>`: **Приложение** => **Выбрать плагины...**.

source: Running the application via a :doc:`command line </user/cli>` with the :ref:`--plugin-selector <cli-plugin-selector>` parameter.
ru: Через :doc:`командную строку </user/cli>` с помощью параметра :ref:`--plugin-selector <cli-plugin-selector>`.

source: The window will open automatically in the following cases:
ru: Окно будет открыто автоматом в следующих случаях:

source: At the application startup, but only if no plugins were specified via the :ref:`--plugins <cli-plugins>` command line parameter.
ru: При первом запуске программы, если не было заранее указано никаких плагинов для загрузки с помощью параметра командной строки :ref:`--plugins <cli-plugins>`.

source: If the last remaining loaded plugin crashes while the application is running.
ru: Если во время работы программы произошёл сбой в работе последнего оставшегося загруженного плагина.

source: Main window
ru: Главное окно

source: In the main window of |project| you can select and configure the desired :doc:`mode <../modes>` for each video card. The window can be divided into the following parts (top-down):
ru: В главном окне |project| можно выбрать и настроить нужный :doc:`режим <../modes>` для каждой видеокарты. Окно можно разделить на следующие части (сверху вниз):

source: **The main menu**. Contains the following items:
ru: **Главное меню**. Содержит следующие пункты:

source: **Application**
ru: **Приложение**

source: **Settings...** - open the window with general application settings.
ru: **Настройки...** - открыть окно c общими настройками приложения.

source: **Select plugins...** - open the window ":doc:`enabledPlugins`".
ru: **Выбрать плагины...** - открыть окно ":doc:`enabledPlugins`".

source: **Exit** - exit the application.
ru: **Выход** - выход из программы.

source: **About**
ru: **Справка**

source: **About Qt...** - information about the version of the Qt library used to make |project| (`<https://qt.io>`_).
ru: **О Qt...** - информация об используемой версии библиотеки Qt, с помощью которой написана программа |project| (`<https://qt.io>`_).

source: **About plugins...** - information about currently loaded plugins. There will be no plugins in this list that were deactivated due to some error.
ru: **О плагинах...** - информация о текущих загруженных плагинах. В этом списке не будет плагинов, в которых произошла какая-либо ошибка, повлекшая к их отключению.

source: **About** |project|\ **...** - a short summary of |project|.
ru: **О** |project|\ **...** - краткая сводка о |project|.

source: **Tabs with video card names**. Used to select a video card for which you want to select and configure its :doc:`mode <../modes>`.
ru: **Вкладки с названиями видеокарт**. Служат для выбора видеокарты, для которой необходимо выбрать и настроить :doc:`режим работы <../modes>`.

source: **Mode switches**. Allow you to select the current video card :doc:`mode <../modes>`. The mode changes immediately, without pressing the "Save" button.
ru: **Переключатели режимов**. Позволяют выбрать текущий :doc:`режим работы <../modes>` видеокарты. Режим меняется сразу, без нажатия на кнопку "Сохранить".

source: **Mode settings**. The major part of the main application window is occupied by settings of the selected mode. All changes are applied immediately, without pressing the "Save" button (:doc:`"script mode" <../modes/script>` restarts the script only on request). To cancel unsaved changes, you need to press the "Cancel" button.
ru: **Настройки режима**. Основную часть главного окна программы занимают настройки выбранного режима. Все изменения применяются сразу, без нажатия на кнопку "Сохранить" (:doc:`режим "скрипт" <../modes/script>` перезапускает скрипт только по запросу). Чтобы отменить несохранённые изменения, следует нажать на кнопку "Отмена".

source: **Buttons**:
ru: **Кнопки**:

source: **Device options...** - open the window ":doc:`devOptions`".
ru: **Настройки устройства...** - открыть окно ":doc:`devOptions`".

source: **Cancel** - Cancels all unsaved mode settings changes.
ru: **Отмена** - отмена всех несохранённых изменений в настройках режимов.

source: **Save** - saves all settings displayed in the main window for all video cards.
ru: **Сохранить** - сохранение всех настроек, отображаемых в главном окне, для всех видеокарт.

source: Tray icon
ru: Иконка в трее

source: A separate tray icon will be displayed for each video card. The icon contains information about the temperature and fan speed:
ru: Для каждой видеокарты будет показана отдельная иконка в трее. Иконка содержит информацию о температуре и видеокарты и скорости вращения вентиляторов:

source: **Temperature** in degrees Celsius is indicated by a number in the center of the icon. The color of the number corresponds to the rules specified in the ":doc:`devOptions`" window.
ru: **Температура** в градусах Цельсия обозначается числом в центре иконки. Цвет числа отвечает правилам, заданным в окне ":doc:`devOptions`".

source: **Fan speed** is indicated by a frame around the number. The color of the frame corresponds to the rules specified in the ":doc:`devOptions`" window.
ru: **Скорость вентиляторов** обозначается рамкой вокруг числа. Цвет рамки отвечает правилам, заданным в окне ":doc:`devOptions`".

source: If you put the cursor over an icon, you can see a pop-up window with a more detailed information summary about the selected video card.
ru: При наведении курсора на иконку можно увидеть всплывающее окно с более подробной сводкой по информации о выбранной видеокарте.

source: Right-clicking on the icon will show the context menu, which can be used to do the following:
ru: Правый клик по иконке покажет контекстное меню, с помощью которого можно сделать следующее:

source: Open the :doc:`main window <mainWindow>` of |project|
ru: Открыть :doc:`главное окно <mainWindow>` |project|

source: Open the :doc:`tray icon color settings <devOptions>`
ru: Открыть окно :doc:`настроек цветов иконки <devOptions>`

source: Open the full user manual in your browser.
ru: Открыть полную документацию по программе в браузере.

source: Exit the application.
ru: Выйти из программы.

source: Left click on the icon will show the :doc:`main window <mainWindow>` of the application.
ru: Левый клик по иконке покажет :doc:`главное окно <mainWindow>` программы.

source: Modes
ru: Режимы

source: The application has four modes to control video card fans.
ru: В программе есть четыре режима управления вентиляторами на видеокарте.

source: :doc:`modes/curve` - graph of fan speed versus temperature.
ru: :doc:`modes/curve` - график зависимости скоростей вентиляторов от температуры.

source: :doc:`modes/fanToggle` - turning fans on and off using configurable set of rules.
ru: :doc:`modes/fanToggle` - включение и отключение вентиляторов по заданным правилам.

source: :doc:`modes/script` - controlling fan speed by an arbitrary algorithm.
ru: :doc:`modes/script` - расчёт скорости вентиляторов по самописному алгоритму.

source: :doc:`modes/gpu` - video card controls the fans.
ru: :doc:`modes/gpu` - передача управления видеокарте.

source: The functionality of ":doc:`modes/curve`" and ":doc:`modes/fanToggle`" modes can also be extended with scripts. See the description of :ref:`"Override" switch <mode-script-override>`.
ru: Функционал режимов ":doc:`modes/curve`" и ":doc:`modes/fanToggle`" также можно расширять с помощью скриптов. См. описание :ref:`переключателя "Переопределение" <mode-script-override>`.

source: Curve
ru: Кривая

source: The "Curve" mode allows you to graphically define the relationship between the video card temperature and the required fan speed.
ru: Режим "Кривая" позволяет графически задать зависимость между температурой видеокарты и необходимой скоростью вращения вентиляторов.

source: The following actions can be performed on the interactive chart:
ru: На интерактивном графике можно совершать следующие действия:

source: Add a new point to the curve by double-clicking on the free space in the chart.
ru: Добавить новую точку на кривую с помощью двойного щелчка на свободном месте графика.

source: Delete a point by double-clicking on it.
ru: Удалить точку с помощью двойного щелчка на ней.

source: Move the point with the mouse.
ru: Переместить точку с помощью мыши.

source: The chart points are shown only when you point the mouse at them.
ru: Точки графика показываются только при наведении на них мышью.

source: The border points of the chart can be moved vertically.
ru: Крайние точки графика можно перемещать по вертикали.

source: The red dot shows the current temperature and fan speed.
ru: Красная точка показывает текущую температуру и скорость вентиляторов.

source: The actual fan speed may not match exactly what is shown on the graph. This depends on the video card. For example, if the video card does not support low fan speeds, the actual fan speed may be 30% when set to 5%.
ru: Реальная скорость вентиляторов может не совпадать точно с тем, что задано на графике. Это зависит от видеокарты. Например, если видеокарта не поддерживает слишком низкие скорости вентиляторов, то при установке скорости вентиляторов в 5%, реальная скорость может быть равна 30%.

source: Hysteresis
ru: Гистерезис

source: Settings in the "Hysteresis"[#hysteresis]_ section specify the lag of temperature, which is used to calculate the fan speed, from the actual current temperature of the video card. This avoids the "contact bounce"[#contact_bounce]_ effect. Let's assume that for 60°C the fan speed is set to 0%, and for 61°C it is set to 15%. If the temperature of the graphics card fluctuates between 60°C and 61°C, the fans will be constantly switching on and off. Hysteresis allows you to not change the speed of the fans immediately, but only if the temperature has not returned to the previous value for some time.
ru: Настройки в разделе "Гистерезис"[#hysteresis]_ задают отставание температуры, которая берётся для расчёта скорости вентиляторов, от реальной текущей температуры видеокарты. Это позволяет избежать эффекта "дребезга контактов"[#contact_bounce]_. Предположим, для температуры 60°C задана скорость вентиляторов 0%, а для 61°C - 15%. Если температура видеокарты будет колебаться между 60°C и 61°C, то вентиляторы будут постоянно включаться и выключаться. Гистерезис позволяет менять скорость вентиляторов не сразу, а только если температура не вернулась к предыдущему значению в течение некоторого времени.
