Repository: alkatrazstudio/gpu-fan-meister
Catalog: docs/src/locale/*/LC_MESSAGES/user.po
Languages: ru

source: |project| can download various third-party resources: :doc:`plugins <plugins>`, documentation and localization. |project| searches for these resources in specific folders. The list of these folders depends on the operating system. A complete list of folders where |project| will search for resources can be obtained through the :ref:`--dirs <cli-dirs>` parameter of the command line. When trying to load a resource |project| searches in all search folders and tries to find the resource in a particular subfolder that matches the resource type. The process of searching and loading each resource type is described below.
ru: |project| в процессе работы может загружать разные сторонние ресурсы: :doc:`плагины <plugins>`, документацию и локализацию. |project| ищет эти ресурсы в определённых папках. Список этих папок зависит от операционной системы. Полный список папок, в которых |project| будет искать ресурсы, можно получить через параметр :ref:`--dirs <cli-dirs>` командной строки. При попытке загрузить какой-либо ресурс |project| перебирает все папки для поиска и пытается найти ресурс в определённой подпапке, которая соответствует типу ресурса. Ниже описан процесс поиска и загрузки каждого типа ресурса.

source: The process of searching and loading :doc:`plugins <plugins>` is as follows:
ru: Процесс поиска и загрузки :doc:`плагинов <plugins>` следующий:

source: All folders are searched in the order returned by the CLI parameter :ref:`--dirs <cli-dirs>`.
ru: Перебираются все папки для поиска в том порядке, который выдаётся CLI-параметром :ref:`--dirs <cli-dirs>`.

source: The plugin is searched in the folder **<current search folder>/plugins/<plugin identifier>**.
ru: Плагин ищется в папке **<текущая папка для поиска>/plugins/<идентификатор-плагина>**.

source: If a plugin is found, then this plugin is loaded, and any plugin with the same name will not be loaded from all other search folders.
ru: Если плагин найден, то он загружается, а все остальные плагины с этим именем из других папок поиска игнорируются.

source: **Example:** If you have a search folder /usr/local/share/|project-id| and a plugin called **amd-mesa**, |project| will be able to load this plugin from /usr/local/share/|project-id|/plugins/amd-mesa.
ru: **Пример:** если имеется папка для поиска /usr/local/share/|project-id|, а плагин называется **amd-mesa**, то |project| сможет загрузить этот плагин из папки /usr/local/share/|project-id|/plugins/amd-mesa.

source: To create your own plugin for |project|, see ":doc:`/dev/plugins`". You can find an example plugin here: `<https://github.com/alkatrazstudio/gpu-fan-meister/blob/master/plugins>`_.
ru: О том, как создать свой плагин для |project|, читайте в разделе ":doc:`/dev/plugins`". Пример плагина вы можете найти здесь: `<https://github.com/alkatrazstudio/gpu-fan-meister/blob/master/plugins>`_.

source: Documentation
ru: Документация

source: The process of searching and loading a documentation is as follows:
ru: Процесс поиска и загрузки документации следующий:

source: Look for the folder **<current search folder>/docs/<language code>**, where **<language code>** is IETF-code\ [#ietf]_ of the language of the system locale.
ru: Ищется папка **<текущая папка для поиска>/docs/<код языка>**, где **<код языка>** - это IETF-код\ [#ietf]_ языка, соответствующий системной локали.

source: If a folder is found, the documentation from this folder is used. All other folders are ignored.
ru: Если папка найдена, то используется документация именно из этой папки. Все остальные папки игнорируются.

source: If no documentation is found in any folder to search for, the last element after the "-" sign is removed from **<language code>** (zh-TW => zh). The process is then repeated.
ru: Если ни в одной папке для поиска документация не найдена, то из **<код языка>** убирается последний элемент после знака "-" (zh-TW => zh). Затем процесс повторяется заново.

source: If the last element of **<language code>** is removed and the documentation is still not found, |project| searches the search folders for documentation for the "en" language (which is guaranteed to be present in at least one search folder).
ru: Если последний элемент из **<код языка>** убран, а документация всё ещё не найдена, то |project| ищет в папках для поиска документацию для языка "en" (которая гарантированно будет присутствовать хотя бы в одной папке для поиска).

source: **Example:** If you have a search folder /usr/local/share/|project-id| and French Canadian is your system locale, |project| will search the documentation in /usr/local/share/|project-id|/docs/fr-CA, /usr/local/share/|project-id|/docs/fr and /usr/local/share/|project-id|/docs/en.
ru: **Пример:** если имеется папка для поиска /usr/local/share/|project-id|, а в системе установлен французский канадский язык, то |project| будет искать документацию в папках /usr/local/share/|project-id|/docs/fr-CA, /usr/local/share/|project-id|/docs/fr и /usr/local/share/|project-id|/docs/en.

source: You can translate the |project| documentation into any language. The documentation is written in `reStructuredText <http://docutils.sourceforge.net/rst.html>`_ and built via `Sphinx <https://www.sphinx-doc.org/>`_. The process of localization/internationalization in Sphinx is described here: `<https://www.sphinx-doc.org/en/master/usage/advanced/intl.html>`_. The script ``docs/src/build.sh`` already does a lot of job for you. In summary, you need to do the following:
ru: Вы можете перевести документацию |project| на любой язык. Документация написана на `reStructuredText <http://docutils.sourceforge.net/rst.html>`_ и собрана с помощью `Sphinx <https://www.sphinx-doc.org/>`_. Процесс локализации в Sphinx описан здесь: `<https://www.sphinx-doc.org/en/master/usage/advanced/intl.html>`_. Скрипт ``docs/src/build.sh`` уже делает большую часть работы за вас. В конечном счёте, вам необходимо сделать следующее:

source: Clone the main repository:
ru: Склонировать основной репозиторий:

source: Generate or update PO-files:
ru: Сгенерировать или обновить PO-файлы:

source: ``docs/src/build.sh <language IETF-code> po``
ru: ``docs/src/build.sh <IETF-код языка> po``

source: Translate the PO-files.
ru: Перевести PO-файлы.

source: Run the documentation build script:
ru: Запустить скрипт сборки документации:

source: ``docs/src/build.sh <language IETF-code>``
ru: ``docs/src/build.sh <IETF-код языка>``

source: Move the generated documentation from the folder **docs/<language IETF-code>** to any :ref:`search folder<resources-docs>`.
ru: Переместить полученную документацию из папки **docs/<IETF-код языка>** в любую :ref:`папку поиска <resources-docs>`.

source: Localization
ru: Локализация

source: The process of searching and loading localization files is as follows:
ru: Процесс поиска и загрузки локализаций следующий:

source: All folders are searched in the order opposite to the one returned by the CLI parameter :ref:`--dirs <cli-dirs>`.
ru: Перебираются все папки для поиска в порядке, обратном тому, который выдаётся CLI-параметром :ref:`--dirs <cli-dirs>`.

source: Localization files are searched in the **<current search folder>/translations** and loaded according to Qt rules: `<https://doc.qt.io/qt-5.12/qtranslator.html#load-1>`_.
ru: Файлы локализации ищутся в папке **<текущая папка для поиска>/translations** и загружаются по правилам Qt: `<https://doc.qt.io/qt-5.12/qtranslator.html#load-1>`_.

source: If a localization file is found, the translation it contains is added to the already loaded localization files. If there are duplicates of translations, the priority will be given to the last loaded localization.
ru: Если файл локализации найден, то содержащийся в нём перевод добавляется к уже загруженным файлам локализации. При наличии дубликатов переводов, приоритет будет отдаваться последней загруженной локализации.

source: **Example:** If you have a search folder /usr/local/share/|project-id| and German is your system locale, |project| can search for files with translations in /usr/local/share/|project-id|/translations/de-DE.qm (or other de-\*.qm files depending on the locale) and /usr/local/share/|project-id|/translations/de.qm.
ru: **Пример:** если имеется папка для поиска /usr/local/share/|project-id|, а в системе установлен немецкий язык, то |project| может искать файлы с переводом в файлах /usr/local/share/|project-id|/translations/de-DE.qm (или в других de-\*.qm файлах в зависимости от локали) и /usr/local/share/|project-id|/translations/de.qm.

source: To create your own translation for |project|, see the Qt Linguist Help: `<https://doc.qt.io/qt-5.12/linguist-translators.html>`_.
ru: О том, как создать свой перевод для |project|, читайте в справке к Qt Linguist: `<https://doc.qt.io/qt-5.12/linguist-translators.html>`_.

source: Wikipedia article "IETF language tag": `<https://en.wikipedia.org/wiki/IETF_language_tag>`_.
ru: Статья "IETF language tag" в Википедии: `<https://en.wikipedia.org/wiki/IETF_language_tag>`_.
