Repository: alkatrazstudio/gpu-fan-meister
Catalog: docs/src/locale/*/LC_MESSAGES/user.po
Languages: ru

source: For convenience, let's label the current video card temperature as |T0|, and the temperature used to calculate the required fan speed according to the graph as |T1|. For example, using the data from the previous example, if |T0| = 61°C and |T1| = 60°C, the fan speed will be 0% as it is calculated based on |T1|. Initially, these temperatures are equal. If |T0| changes, |T1| stars moving towards |T0|, but only after a specified time or if the difference between |T0| and |T1| is greater than the specified value.
ru: Для удобства обозначим текущую температуру видеокарты как |T0|, а температуру, которая используется для расчёта требуемой скорости вентиляторов по графику, как |T1|. Например, используя данные из предыдущего примера, если |T0| = 61°C, а |T1| = 60°C, то скорость вентиляторов будет равна 0%, т.к. она рассчитывается на основе |T1|. Изначально эти температуры равны. Если |T0| изменится, то |T1| начинает стремиться к |T0|, но только спустя заданное время или если разница между |T0| и |T1| больше определённого значения.

source: |project| allows to set the following hysteresis parameters:
ru: В |project| можно задавать следующие параметры гистерезиса:

source: **Max inc. temp. diff.** - when the temperature |T0| increases, |T1| may lag behind |T0| by a specified number of degrees Celsius maximum.
ru: **Макс. увел. темп.** - при росте температуры |T0|, |T1| может отставать от |T0| максимум на указанное число градусов Цельсия.

source: **Inc. delay** - if |T0| > |T1|, then |T1| starts moving towards |T0| only after the specified number of seconds.
ru: **Задержка увел.** - если |T0| > |T1|, то |T1| начинает приближаться к |T0| только после указанного кол-ва секунд.

source: **Max inc. temp. diff.** - when the temperature |T0| decreases, |T1| may lag behind |T0| by a specified number of degrees Celsius maximum.
ru: **Макс. увел. темп.** - при росте температуры |T0|, |T1| может отставать от |T0| максимум на указанное число градусов Цельсия.

source: **Dec. delay** - if |T0| < |T1|, then |T1| starts moving towards |T0| only after the specified number of seconds.
ru: **Задержка уменьш.** - если |T0| < |T1|, то |T1| начинает приближаться к |T0| только после указанного кол-ва секунд.

source: Notes
ru: Примечания

source: The "Hysteresis" article in Wikipedia: `<https://en.wikipedia.org/wiki/Hysteresis>`_.
ru: Статья "Гистерезис" в Википедии: `<https://ru.wikipedia.org/wiki/Гистерезис>`_.

source: The "Contact bounce" article in Wikipedia: `<https://en.wikipedia.org/wiki/Switch#Contact_bounce>`_.
ru: Статья "Дребезг контактов" в Википедии: `<https://ru.wikipedia.org/wiki/Дребезг_контактов>`_.

source: Fan toggle
ru: Вкл./выкл. вентиляторов

source: The "Fan toggle" mode allows you to turn the video card fans on and off according to configurable rules. The speed of the switched on fans is controlled by the video card itself.
ru: Режим "Вкл./выкл. вентиляторов" позволяет включать и выключать вентиляторы на видеокарте по определённым правилам. При этом, скоростью включённых вентиляторов управляет сама видеокарта.

source: The video card can set the fan speed to zero, but the fans will still be considered to be turned on. In other words, "turned on fan" here means a fan whose speed is controlled by the video card, and "turned off fan" is a fan that does not rotate and the video card does not control it.
ru: Видеокарта может установить скорость включённых вентиляторов в ноль, но вентиляторы будут всё равно считаться включёнными. Другими словами, под термином "включённый вентилятор" здесь подразумевается вентилятор, скоростью которого может управлять видеокарта, а "отключённый вентилятор" - это вентилятор, который не крутится, и, при этом, видеокарта не может им управлять.

source: The two rules by which the fans will be switched off are combined by logical OR. That is, if both of these rules are checked, the fans will be disabled when any of these conditions are met.
ru: Два правила, по которым вентиляторы будут отключаться, объединяются логическим ИЛИ. Т.е. если отмечены оба этих правила, то вентиляторы будут отключаться, когда наступит любое из этих условий.

source: The rules work with an accuracy of one second.
ru: Правила могут срабатывать с погрешностью в одну секунду.

source: GPU controlled
ru: Под управлением GPU

source: The "GPU controlled" mode fully transfers the fan speed control to the video card. In this mode the video card itself decides what fan speed to set.
ru: Режим "Под управлением GPU" полностью передаёт управление скоростями вентиляторов видеокарте. В данном режиме видеокарта сама решает, какую скорость вентиляторов устанавливать.

source: Script
ru: Скрипт

source: The "Script" mode allows you to set an arbitrary algorithm for calculating the required speed of the video card fans. Every second information about the current state of the video card, including its temperature, will be transmitted to the script\ [#script]_ . Based on this information, the script can make one of the following decisions:
ru: Режим "Скрипт" позволяет задать произвольный алгоритм для расчёта требуемой скорости вентиляторов видеокарты. Каждую секунду в скрипт\ [#script]_ будет передаваться информация о текущем состоянии видеокарты, в т.ч. её температура. На основе этой информации скрипт может принять одно из следующих решений:

source: Set the required fan speed.
ru: Задать требуемую скорость вентиляторов.

source: Let the video card determine the desired fan speed.
ru: Дать видеокарте определить нужную скорость вентиляторов.

source: The algorithm is written in ECMAScript 6\ [#javascript]_ language.
ru: Алгоритм описывается с помощью языка ECMAScript 6\ [#javascript]_.

source: The source code must contain the main function that will be called every second. This function must be the last function to be called by the script operator. This can be done in two ways:
ru: В тексте программы должна быть главная функция, которая будет вызываться каждую секунду. Ссылка на эту функцию должна идти последним выполняемым оператором скрипта. Это можно сделать двумя способами:

source: Implement the main function as an arrow function\ [#arrow-function]_ and put it at the end of the script.
ru: Реализовать главную функцию как стрелочную функцию\ [#arrow-function]_ и поставить её в конец скрипта.

source: <code before the main function> ()=>{ <the main function code> } // end of the script
ru: <код до главной функции> ()=>{ <код главной функции> } // конец скрипта

source: Place the function identifier as the last script operator.
ru: Прописать идентификатор функции последним оператором скрипта.

source: function f1() { <code of the first function> } function f2() { <code of the second function> } // choosing the main function depending on the plugin category $.dev.plugin.category == 'nvidia' ? f1 : f2 // end of the script
ru: function f1(){ <код первой функции> } function f2(){ <код второй функции> } // выбор главной функции в зависимости от категории плагина $.dev.plugin.category == 'nvidia' ? f1 : f2 // конец скрипта

source: The main function will only be executed if the script is :ref:`running <mode-script-status-running>`. Below is an example of the script that sets the fan speed if the temperature has risen above 60°C, and if the temperature is below 60°C, the script gives the fan control to the video card.
ru: Главная функция будет выполняться, только если скрипт :ref:`запущен <mode-script-status-running>`. Ниже приведён пример скрипта, который устанавливает скорость вентиляторов, если температура поднялась выше 60°C, а если температура ниже 60°C, то скрипт отдаёт управление вентиляторами видеокарте.

source: // When the script is launched for the first time, // the code that is located outside of the main function // will be executed. // Here you can initialize the variables // and define additional functions. var tempThreshold = 60 function getTimestamp() { return Math.round(Date.now() / 1000) } // Next comes the main function that will be called every second. ()=>{ var secsPassed = getTimestamp() - tsStart if(secsPassed && secsPassed % 10 == 0) console.log('The script is running for '+secsPassed+' seconds') // $.dev.curTemp - current video card temperature if($.dev.curTemp > tempThreshold) return $.dev.curTemp / 2 // set the fan speed else return $.dev.FAN_SPEED_GPU // let the video card determine the fan speed }
ru: // При первом запуске скрипта, будет выполнен код, // который находится вне главной функции. // Здесь можно произвести инициализацию переменных // и определить дополнительные функции. var tempThreshold = 60 function getTimestamp() { return Math.round(Date.now() / 1000) } // Далее идёт главная функция, которая будет вызываться каждую секунду. ()=>{ var secsPassed = getTimestamp() - tsStart if(secsPassed && secsPassed % 10 == 0) console.log('Скрипт работает в течение '+secsPassed+' секунд') // $.dev.curTemp - текущая температура видеокарты if($.dev.curTemp > tempThreshold) return $.dev.curTemp / 2 // установить скорость вентиляторов else return $.dev.FAN_SPEED_GPU // дать видеокарте определить скорость }

source: It is recommended to read the following information before writing the script:
ru: Перед написанием скрипта рекомендуется ознакомится со следующей информацией:

source: The list of available built-in ECMAScript objects: `<https://doc.qt.io/qt-5.12/ecmascript.html>`_.
ru: Встроенные объекты ECMAScript, доступные для использования: `<https://doc.qt.io/qt-5.12/ecmascript.html>`_.

source: Interface description of the "Script" mode window
ru: Описание интерфейса окна режима "Скрипт"

source: Code editor
ru: Редактор кода

source: Code editor with minimal functionality and syntax highlighting. In addition to text editing, it allows you to perform the following actions:
ru: Редактор кода с минимальным функционалом и подсветкой синтаксиса. Помимо редактирования текста позволяет выполнять следующие действия:

source: "CTRL + mouse wheel" adjusts the size of the text.
ru: "CTRL + колёсико мыши" регулирует размер текста.

source: The Tab key can move selected text block to the right.
ru: Клавиша Tab может передвигать блоки текста вправо, если предварительно выделить нужный блок.

source: Shift+Tab can move selected text block to the left.
ru: Shift+Tab может передвигать блоки текста влево, если предварительно выделить нужный блок.

source: It is important to remember that the source code displayed in the editor may not match the source code of the currently running script. Changing the source code in the editor will not affect the already running script. To start the script with the new source code, you should press the "Apply and restart" button.
ru: Важно помнить, что текст, отображаемый в редакторе, может не соответствовать тексту текущего выполняемого скрипта. Изменение текста в редакторе не будет влиять на уже запущенный скрипт. Чтобы запустить скрипт с новым текстом, необходимо нажать кнопку "Применить и перезапустить".

source: Script status
ru: Состояние скрипта

source: May contain several comma-separated values. Possible values:
ru: Может содержать несколько значений, отделённых запятой. Возможные значения:

source: **started** - the script is running and the source code displayed in the editor corresponds to the source code of the running script.
ru: **запущен** - скрипт запущен, и текст, который отображается в редакторе, соответствует тексту запущенного скрипта.

source: **running old script** - the script is running, but the source code that is displayed in the editor has been changed since the start of the script and no longer matches the source code of the running script.
ru: **запущен старый скрипт** - скрипт запущен, но текст, который отображается в редакторе, был изменён с момента запуска скрипта и больше не соответствует тексту запущенного скрипта.

source: **paused** - the script was initialized, but is temporarily suspended. This may happen if the script is in the :ref:`"Override" mode <mode-script-override>`.
ru: **на паузе** - скрипт был инициализирован, но временно не выполняется. Как правило, это связано с тем, что скрипт находится в режиме :ref:`"Переопределение" <mode-script-override>`.

source: **old script paused** - same as the previous status, but the source code that is displayed in the editor, has been changed since the start of the script and no longer corresponds to the source code of the initialized script.
ru: **на паузе старый скрипт** - то же самое, что предыдущий пункт, но текст, который отображается в редакторе, был изменён с момента запуска скрипта и больше не соответствует тексту инициализированного скрипта.

source: **stopped** - the script is not active and will not be executed.
ru: **остановлен** - скрипт не активен и не будет выполняться.

source: **not saved** - the current source code displayed in the editor has not been saved to disk and will be lost when the program restarts.
ru: **не сохранён** - текущий текст, который отображается в редакторе, не был сохранён на диск и будет утерян при перезапуске программы.

source: Override
ru: Переопределение

source: If this switch is enabled, the script will only work when other modes are enabled (except ":doc:`gpu`" mode). Every second the internal algorithm of the selected mode will be executed, and then the script will be executed to further modify the resulting fan speed that has been set in that mode.
ru: Если включён данный переключатель, то скрипт будет работать, только когда включены другие режимы (кроме режима ":doc:`gpu`"). При этом каждую секунду будет выполняться внутренний алгоритм выбранного режима, а затем будет выполняться скрипт, чтобы иметь возможность модифицировать желаемую скорость вентиляторов, которую установил режим.

source: For example, if you check the "Override" box, run the script and enable the ":doc:`curve`" mode, the following will happen every second:
ru: Например, если установить галку "Переопределение", запустить скрипт и включить режим ":doc:`curve`", то каждую секунду будет происходить следующее:

source: The required fan speed is calculated from the curve points and hysteresis
ru: На основе точек кривой и гистерезиса рассчитывается требуемая скорость вентиляторов

source: This speed is stored in the :ref:`$.dev.targetFanSpeed <script-ref-dev-targetFanSpeed>` variable.
ru: Эта скорость сохраняется в переменной :ref:`$.dev.targetFanSpeed <script-ref-dev-targetFanSpeed>`.

source: The main function of the script is called. It can return either another desired fan speed or **$.dev.targetFanSpeed** (or :ref:`$.dev.FAN_SPEED_NO_CHANGE <script-ref-dev-fanSpeedNoChange>`) to leave the calculated speed as is.
ru: Вызывается главная функция скрипта. Она может вернуть либо другое желаемое значение скорости вентиляторов, либо **$.dev.targetFanSpeed** (или :ref:`$.dev.FAN_SPEED_NO_CHANGE <script-ref-dev-fanSpeedNoChange>`), если требуется установить ту скорость, которую выбрал текущий режим программы.

source: The main function return value will become the final target fan speed. The script can also return **$.dev.FAN_SPEED_GPU** to let the video card choose the fan speed.
ru: То, что вернула главная функция скрипта, принимается за конечное значение скорости вентиляторов, которое требуется установить для видеокарты. Естественно, скрипт может также вернуть **$.dev.FAN_SPEED_GPU**, чтобы видеокарта сама решила, какая скорость нужна.

source: If "Override" is enabled, the script cannot work when "Script" mode is enabled. Therefore, in this case, it will be :ref:`paused <mode-script-status-paused>`. If "Override" is not enabled, the script will work only when the "Script" mode is selected, otherwise it will be paused. The script will also be paused if the ":doc:`gpu`" mode is selected. The script will be paused only if it has been started.
ru: При включённом "Переопределении" скрипт не может работать, когда включён режим "Скрипт". Поэтому в данном случае, он будет :ref:`поставлен на паузу <mode-script-status-paused>`. Если "Переопределение" не включено, то скрипт будет работать только при выбранном режиме "Скрипт", а иначе - будет поставлен на паузу. Скрипт также будет поставлен на паузу, если будет выбран режим ":doc:`gpu`". Естественно, скрипт будет поставлен на паузу, только если он был предварительно запущен.

source: Apply and restart
ru: Применить и перезапустить

source: Restarts the script with the new source code taken from the editor. After that the script will be executed every second (taking into account the :ref:`"Override" mode<mode-script-override>`). The sequence will be as follows:
ru: Перезапускает скрипт с новым текстом, взятым из редактора. После этого скрипт будет выполняться каждую секунду (с учётом режима :ref:`"Переопределение" <mode-script-override>`). При этом последовательность будет следующей:

source: If the script was :ref:`running <mode-script-status-running>` or was :ref:`paused <mode-script-status-paused>` it will be :ref:`stopped <mode-script-status-paused>`.
ru: Если скрипт был :ref:`запущен <mode-script-status-running>` или :ref:`стоял на паузе <mode-script-status-paused>`, то он будет :ref:`остановлен <mode-script-status-paused>`.

source: The source code in the code editor will be used as the source code for the new script.
ru: Текст, который прописан в редакторе кода, будет использоваться в качестве текста нового скрипта.

source: The script is initialized (running). The script must specify the :ref:`main function <mode-script-mainFunction>`.
ru: Скрипт инициализируется (выполняется). При этом, скрипт должен задать :ref:`главную функцию <mode-script-mainFunction>`.

source: If the :ref:`"Override" <mode-script-override>` switch is set, the script will be :ref:`paused <mode-script-status-paused>`, otherwise it will be in the :ref:`"running" <mode-script-status-running>` state.
ru: Если установлен переключатель :ref:`"Переопределение" <mode-script-override>`, то скрипт будет :ref:`поставлен на паузу <mode-script-status-paused>`, а иначе - переведён в состояние :ref:`"запущен" <mode-script-status-running>`.

source: Stop
ru: Остановить

source: Stops the script.
ru: Останавливает скрипт.

source: "Script" ("Scripting language") article in Wikipedia: `<https://en.wikipedia.org/wiki/Scripting_language>`_.
ru: Статья "Скрипт" ("Сценарный язык") в Википедии: `<https://ru.wikipedia.org/wiki/Скрипт>`_.

source: "ECMAScript" article in Wikipedia: `<https://en.wikipedia.org/wiki/ECMAScript>`_.
ru: Статья "ECMAScript" в Википедии: `<https://ru.wikipedia.org/wiki/ECMAScript>`_.

source: "Arrow functions" article in MDN: `<https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/Arrow_functions>`_.
ru: Статья "Стрелочные функции" в MDN: `<https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Functions/Arrow_functions>`_.

source: Script objects reference
ru: Справка по скриптовым объектам

source: The script has access to almost all of the settings of the application, the current GPU, and individual modes that are available from the GUI. Also, there is access to some system functions. All these functions and parameters are accessible through global object ``$``. Below, in the documentation, if not specified otherwise, it is considered that object fields are read-only.
ru: Скрипту доступны практически все настройки программы, текущего GPU и отдельных режимов работы, которые доступны из GUI. Также, имеется доступ к некоторым системным функциям. Все эти функции и параметры доступны через глобальный объект ``$``. Ниже, в документации, если не указано обратное, то считается, что поле объекта доступно только для чтения.

source: In addition, there is access to most standard ECMAScript functions and objects. The list of supported ECMAScript objects can be found here: `<https://doc.qt.io/qt-5.12/ecmascript.html>`_.
ru: Помимо этого, имеется доступ и к большинству стандартных функций и объектов ECMAScript. Список поддерживаемых объектов ECMAScript можно найти здесь: `<https://doc.qt.io/qt-5.12/ecmascript.html>`_.

source: The following objects can be accessed via script:
ru: Через скрипт можно получить доступ к следующим объектам:

source: Constants
ru: Константы

source: The script should return this constant from the main function if you need to pass the fan control to the video card during this step of the script.
ru: Скрипт должен вернуть эту константу из основной функции, если на данном шаге выполнения скрипта необходимо передать управление вентиляторами видеокарте.

source: The script should return this constant from the main function if at this step of the script the program should not influence the speed of the fans in any way. Thus, speed of fans can change nevertheless if the fans are currently controlled by video card (for example, on the previous step the script main function has returned :ref:`$.dev.FAN_SPEED_GPU <script-ref-dev-fanSpeedGpu>`).
ru: Скрипт должен вернуть эту константу из основной функции, если на данном шаге выполнения скрипта программе не следует никак влиять на скорость вентиляторов. При этом, скорость вентиляторов всё же может измениться, если ей на данный момент управляет видеокарта (например, на прошлом шаге главная функция скрипта вернула :ref:`$.dev.FAN_SPEED_GPU <script-ref-dev-fanSpeedGpu>`).

source: The constants describing application :doc:`modes <../../modes>`. For more details, see :ref:`description of $.dev.mode <script-ref-dev-mode>`.
ru: Константы, обозначающие :doc:`режимы <../../modes>` работы программы. Подробнее см. в :ref:`описании $.dev.mode <script-ref-dev-mode>`.

source: Constants that indicate the status of the script. For more information, see :ref:`description of $.dev.scriptStatus <script-ref-dev-scriptStatus>`.
ru: Константы, обозначающие состояние скрипта. Подробнее см. в :ref:`описании $.dev.scriptStatus <script-ref-dev-scriptStatus>`.

source: Constants indicating the stage at which the execution of an external program launched from the script was interrupted. For more details, see :ref:`the corresponding section <script-ref-sys-exec-failedAt>` of the **$.sys.exec** function description.
ru: Константы, обозначающие этап, на котором выполнение запущенной из скрипта внешней программы прервалось. Подробнее см. в :ref:`соответствующем разделе <script-ref-sys-exec-failedAt>` описания функции **$.sys.exec**.

source: Current GPU details
ru: Данные о текущем GPU

source: Unique GPU identifier.
ru: Уникальный идентификатор GPU.

source: *Example:* :code:`"GPU-c3b01b58-4dbf-1e8f-8f72-a8360f030d4c"`
ru: *Пример:* :code:`"GPU-c3b01b58-4dbf-1e8f-8f72-a8360f030d4c"`

source: The name of the GPU specified by its manufacturer.
ru: Название GPU, заданное его производителем.

source: *Example:* :code:`"GeForce GTX 1060 6GB"`
ru: *Пример:* :code:`"GeForce GTX 1060 6GB"`

source: The name of the GPU that appears in the graphical interface of the application. If the user has specified the custom name (**$.dev.customName** is not an empty string), then this name will be **$.dev.name**, otherwise it will be the value of **$.dev.realName**.
ru: Название GPU, которое отображается в графическом интерфейсе программы. Если пользователь задал своё название (**$.dev.customName** не пустая строка), то это название будет в **$.dev.name**, иначе там будет значение из **$.dev.realName**.

source: *Example:* :code:`"My Fast GPU :)"`
ru: *Пример:* :code:`"My Fast GPU :)"`

source: Current GPU temperature in degrees Celsius.
ru: Текущая температура GPU в градусах Цельсия.

source: The current fan speed in the range from 0 to 100. It may differ from the speed returned by the :ref:`main function <mode-script-mainFunction>`, depending on the speed actually supported by the video card.
ru: Текущая скорость вентиляторов в диапазоне от 0 до 100. Может отличаться от той скорости, которую вернула :ref:`главная функция <mode-script-mainFunction>`, в зависимости от того, какие скорости реально поддерживаются видеокартой.
