Repository: alkatrazstudio/gpu-fan-meister
Catalog: docs/src/locale/*/LC_MESSAGES/user.po
Languages: ru

source: If **true**, the field :ref:`$.dev.totalMemory <script-ref-dev-totalMemory>` contains correct data.
ru: Если **true**, то поле :ref:`$.dev.totalMemory <script-ref-dev-totalMemory>` содержит правильные данные.

source: If **true**, the field :ref:`$.dev.freeMemory <script-ref-dev-freeMemory>` contains the correct data.
ru: Если **true**, то поле :ref:`$.dev.freeMemory <script-ref-dev-freeMemory>` содержит правильные данные.

source: The list of functions that can be run via :ref:`$.dev.customFunction <script-ref-dev-customFunction>`. You can find the description of each function in the documentation of the corresponding plugin.
ru: Список функций, которые можно запустить через :ref:`$.dev.customFunction <script-ref-dev-customFunction>`. Описание каждой из функций ищите в документации к соответствующему плагину.

source: Application info
ru: Данные о приложении

source: Application ID.
ru: Идентификатор приложения.

source: *Example:* ``"|project-id|"``
ru: *Пример:* ``"|project-id|"``

source: Application name.
ru: Название приложения.

source: *Example:* ``"|project|"``
ru: *Пример:* ``"|project|"``

source: Author of the application.
ru: Автор приложения.

source: *Example:* ``"|project-org|"``
ru: *Пример:* ``"|project-org|"``

source: Application version in the `SemVer <https://semver.org>`_ format.
ru: Версия приложения в формате `SemVer <https://semver.org/lang/ru/>`_.

source: Major version of the application. For example, for version **1.0.5**, the major version will be **1**. Read more about version numbers here: `SemVer <https://semver.org>`_.
ru: Мажорная версия плагина. Например, для версии **1.0.5** мажорная версия будет равна **1**. Подробнее о системе нумерации версий см. `SemVer <https://semver.org/lang/ru/>`_.

source: Minor version of the application. For example, for version **1.0.5**, the minor version will be **0**. Read more about version numbers here: `SemVer <https://semver.org>`_.
ru: Минорная версия плагина. Например, для версии **1.0.5** минорная версия будет равна **0**. Подробнее о системе нумерации версий см. `SemVer <https://semver.org/lang/ru/>`_.

source: Patch version of the application. For example, for version **1.0.5** the patch version will be **5**. Read more about version numbers here: `SemVer <https://semver.org>`_.
ru: Патч-версия плагина. Например, для версии **1.0.5** патч-версия будет равна **5**. Подробнее о системе нумерации версий см. `SemVer <https://semver.org/lang/ru/>`_.

source: System info
ru: Данные о системе

source: Through the **$.sys** object, the script can access some system features (e.g. operating system name). Properties of the given object correspond to the methods described in `<https://doc.qt.io/qt-5.12/qsysinfo.html>`_.
ru: Через объект **$.sys** скрипт может получить доступ к некоторым характеристикам системы (например, название операционной системы). Свойства данного объекта соответствуют методам, описанным на `<https://doc.qt.io/qt-5.12/qsysinfo.html>`_.

source: Full description of the architecture for which the current application is built.
ru: Полное описание архитектуры, для которой предназначена текущая сборка приложения.

source: *Example:* ``"x86_64-little_endian-lp64"``
ru: *Пример:* ``"x86_64-little_endian-lp64"``

source: CPU architecture for which the current application is built.
ru: Архитектура CPU, для которой предназначена текущая сборка приложения.

source: *Example:* ``"x86_64"``
ru: *Пример:* ``"x86_64"``

source: The CPU architecture on which the application is currently running.
ru: Архитектура CPU, на котором выполняется сейчас программа.

source: Type of operating system kernel.
ru: Тип ядра операционной системы.

source: *Example:* ``"linux"``
ru: *Пример:* ``"linux"``

source: Operating system kernel version.
ru: Версия ядра операционной системы.

source: *Example:* ``"4.15.0-34-lowlatency"``
ru: *Пример:* ``"4.15.0-34-lowlatency"``

source: Name of the operating system (may not correspond to the actual name).
ru: Название операционной системы (может не соответствовать действительности).

source: *Example:* ``"Ubuntu 18.04.1 LTS"``
ru: *Пример:* ``"Ubuntu 18.04.1 LTS"``

source: Type of operating system distribution.
ru: Тип дистрибутива операционной системы.

source: *Example:* ``"ubuntu"``
ru: *Пример:* ``"ubuntu"``

source: Operating system version.
ru: Версия операционной системы.

source: *Example:* ``"18.04"``
ru: *Пример:* ``"18.04"``

source: System functions
ru: Системные функции

source: Launch an external program. In the **parts** array you can specify an executable file (the first element) as well as arguments for the program to be run (the following elements). If you don't need arguments, you can specify the executable file as a string instead of an array in **parts**.
ru: Запуск внешней программы. В массиве **parts** можно задать исполняемый файл (первый элемент), а также аргументы для запускаемой программы (последующие элементы). Если аргументы не нужны, то вместо массива в **parts** можно указать исполняемый файл как строку.

source: **opts** - options. List of supported options for **$.sys.exec**:
ru: **opts** - набор параметров. Список поддерживаемых параметров для **$.sys.exec**:

source: A set of environment variables. This set will be added to the environment variables with which |project| was launched. If the names of the variables match the existing variables, the variables from **env** will overwrite the variables of |project|.
ru: Набор переменных окружения. Этот набор будет добавлен к переменным окружения, с которыми был запущен |project|. При совпадении названий переменных, переменные из **env** перезапишут переменные |project|.

source: *Default:* ``{}``
ru: *Значение по-умолчанию:* ``{}``

source: Do not wait until the process is completed, and return control of the script immediately. You will not be able to get the exit code or data from stdout and stderr.
ru: Не дожидаться, пока процесс завершится, а вернуть управление скрипту сразу же. При этом, нельзя будет получить код выхода или данные из stdout и stderr.

source: *Default:* ``false``
ru: *Значение по-умолчанию:* ``false``

source: Maximum allowable program execution time in seconds. If the program takes longer to complete than the specified time, it is forcibly terminated.
ru: Максимально допустимое время выполнения программы в секундах. Если запускаемая программа выполняется дольше, чем указанное время, то она принудительно завершается.

source: *Default:* ``3``
ru: *Значение по-умолчанию:* ``3``

source: String data in the UTF-8 encoding, which will be transferred to the launched program into the standard stdin input stream.
ru: Строковые данные в кодировке UTF-8, которые будут переданы запускаемой программе в стандартный поток ввода stdin.

source: *Default:* ``""``
ru: *Значение по-умолчанию:* ``""``

source: **$.sys.exec** returns an object that contains information about the launched process:
ru: **$.sys.exec** возвращает объект, в котором содержится информация о запущенном процессе:

source: If **true**, the program has been successfully launched. This does not mean, however, that the program has been successfully completed.
ru: Если **true**, то программа была успешно запущена. Это, однако, не означает, что программа была успешно завершена.

source: If **true**, an unexpected failure has occurred during the program operation. Absent if **opts.detached** = ``true``.
ru: Если **true**, то в процессе работы программы произошёл непредвиденный сбой. Отсутствует, если **opts.detached** = ``true``.

source: State name of the stage at which the error occurred in the program.
ru: Идентификатор этапа, на котором произошла ошибка в программе.

source: Description of the situation
ru: Описание ситуации

source: Couldn't start the program.
ru: Не удалось запустить программу.

source: Error in writing data to stdin. If **crashed** = ``false``, then the time allotted for writing data to stdin has expired.
ru: Ошибка при записи данных в stdin. Если **crashed** = ``false``, то значит время, отведённое на запись данных в stdin, истекло.

source: Error pending completion of the program. If **crashed** = ``false``, it means that the program has not been completed in time.
ru: Ошибка при ожидании завершения программы. Если **crashed** = ``false``, то значит программа не успела завершиться в срок.

source: If **opts.detached** = ``true``, then this parameter can only contain the value ``$.sys.FAILED_AT_START``.
ru: Если **opts.detached** = ``true``, то данный параметр может содержать только значение ``$.sys.FAILED_AT_START``.

source: Contents of the standard program output (stdin), represented as a string in the UTF-8 encoding. Absent if **opts.detached** = ``true``.
ru: Содержимое стандартного вывода программы (stdin), представленное как строка в кодировке UTF-8. Отсутствует, если **opts.detached** = ``true``.

source: Contents of the standard program error output (stderr), represented as a string in the UTF-8 encoding. Absent if **opts.detached** = ``true``.
ru: Содержимое стандартного вывода ошибок программы (stderr), представленное как строка в кодировке UTF-8. Отсутствует, если **opts.detached** = ``true``.

source: Program exit code. Absent if **opts.detached** = ``true``.
ru: Код выхода программы. Отсутствует, если **opts.detached** = ``true``.

source: // execute the program and show the result console.log($.sys.exec('fortune').stdout) // execute the program and check if there's any startup error if($.sys.exec('ls').failedAt == $.sys.FAILED_AT_START) console.log('Program failed to start') // execute the program by passing the data into stdin and additional arguments var result = $.sys.exec(['cowsay', '-t'], { stdin: $.dev.name, timeout: 1 }) console.log( result.exitCode === 0 ? result.stdout : 'Error: ' + result.failedAt + ': ' + result.stderr )
ru: // выполнить программу и показать результат console.log($.sys.exec('fortune').stdout) // выполнить программу и проверить, не произошла ли ошибка приз запуске if($.sys.exec('ls').failedAt == $.sys.FAILED_AT_START) console.log('Программу не удалось запустить') // выполнить программу, передав ей данные в stdin и дополнительные аргументы var result = $.sys.exec(['cowsay', '-t'], { stdin: $.dev.name, timeout: 1 }) console.log( result.exitCode === 0 ? result.stdout : 'Произошла ошибка: ' + result.failedAt + ': ' + result.stderr )

source: Helper functions
ru: Вспомогательные функции

source: Convert a string containing color information (**ColorString** type) into an object containing information on individual RGBA color components (**ColorObject** type) and vice versa. The suffix "F" means that **ColorObject** contains data in normalized form (from 0 to 1 inclusive). Functions without this suffix imply that each RGBA color component contains values in the range from 0 to 255 inclusive. Type **ColorString** can be a string in the following formats: **#rrggbb** (e.g. ``"#ff9900"``), **#aarrggbb** (e.g. ``"#eeff9900"``) or string color representation (e.g. ``"lightblue"``). The **toColor** and **toColorF** functions return the color in **#rrggbb** format if the color is not transparent (alpha channel has a maximum value). If transparency is available, these functions return the color in **#aarrggbb** format.
ru: Преобразование строки, содержащую информацию о цвете (тип **ColorString**), в объект, содержащий информацию по отдельным цветовым компонентам RGBA (тип **ColorObject**), и наоборот. Суффикс "F" означает, что **ColorObject** содержит данные в нормализованной форме (от 0 до 1 включительно). Функции без этого суффикса подразумевают, что каждая цветовая компонента RGBA содержит значения в диапазоне от 0 до 255 включительно. Тип **ColorString** может представлять из себя строку в следующих форматах: **#rrggbb** (например, ``"#ff9900"``), **#aarrggbb** (например, ``"#eeff9900"``) или строковое представление цвета (например, ``"lightblue"``). Функции **toColor** и **toColorF** воззвращают цвет в формате **#rrggbb**, если прозрачность у цвета отсутствует (альфа-канал имеет максимальное значение). Если прозрачность имеется, то эти функции возвращают цвет в формате **#aarrggbb**.

source: Create a copy of the object **obj**. If **deep** = ``true``, then recursively create copies of all nested properties of the object. If **deep** = ``false``, the object properties are copied by simple assignment.
ru: Создание копии объекта **obj**. Если **deep** = ``true``, то рекурсивно создаются копии всех вложенных свойств объекта. Если **deep** = ``false``, то свойства объектов копируются путём простого присваивания.

source: Plugins
ru: Плагины

source: |project| does not support video cards by itself. This feature is added by plugins. Each plugin is a set of files that will be loaded by the main application.
ru: |project| не имеет поддержки видеокарт сам по себе. Эту возможность добавляют плагины. Каждый плагин представляет из себя набор файлов, которые будут загружаться основной программой.

source: Before you start using |project|, you need to install a plugin that supports your video card. You can download the required plugin from the Internet or :doc:`write it yourself </dev/plugins>`. Plugins should be placed in one of the :doc:`search folders <resources>`, in the subfolder **plugins/<id>**. For example, if the plugin is called **amd-mesa-free** and one of the search folders /usr/local/share/|project-id|, the plugin can be placed in /usr/local/share/|project-id|/plugins/amd-mesa-free to be detected by the application.
ru: Перед тем, как начать пользоваться |project|, вам надо установить плагин, который поддерживает вашу видеокарту. Вы можете скачать нужный плагин из интернета или :doc:`написать его сами </dev/plugins>`. Плагины должны размещаться в одной из :doc:`папок для поиска <resources>`, в подпапке **plugins/<id>**. Например, если плагин называется **amd-mesa-free**, а одна из папок поиска /usr/local/share/|project-id|, то плагин, чтобы его могло обнаружить приложение, может быть размещён в папке /usr/local/share/|project-id|/plugins/amd-mesa-free.

source: List of plugins supported by the |project| developer:
ru: Список плагинов, поддерживаемых разработчиком |project|:

source: :doc:`plugins/nvidia-nvml` is a plugin for managing NVIDIA video cards that run under official proprietary drivers.
ru: :doc:`plugins/nvidia-nvml` - плагин для управления видеокартами NVIDIA, которые работают под управлением официальных проприетарных драйверов.

source: :doc:`plugins/test-manual` - a plugin that emulates the video card and allows you to manually set the current temperature.
ru: :doc:`plugins/test-manual` - плагин, эмулирующий видеокарту и позволяющий вручную задавать текущую температуру.

source: Downloaded plugins will have the same access rights as the account from which |project| is launched, i.e. almost full access to all your data.
ru: Загруженные плагины будут иметь те же права доступа, что и учётная запись, из под которой происходит запуск |project|, т.е. почти полный доступ ко всем вашим данным.

source: The first time you start the program, the ":doc:`gui/enabledPlugins`" window will open, where you can select the plugins you want to automatically load at subsequent program launches. This window can also be opened manually - read more in :doc:`this window description <gui/enabledPlugins>`.
ru: При первом запуске программы будет открыто окно ":doc:`gui/enabledPlugins`", где можно выбрать плагины, которые вы хотите автоматически загружать при последующих запусках программы. Это окно также можно открыть вручную - подробнее читайте в :doc:`справке к этому окну <gui/enabledPlugins>`.

source: This plugin, which comes with |project|, allows you to control NVIDIA video cards with official proprietary drivers installed.
ru: Данный плагин, который поставляется вместе с |project|, позволяет контролировать видеокарты NVIDIA, для которых установлены официальные проприетарные драйвера.

source: The following things are required to operate this plugin:
ru: Для работы этого плагина требуются следующие вещи:

source: NVIDIA Kepler or newer architecture graphics cards (GeForce 600 series and later). At your own risk, you can try this plugin with Fermi architecture cards (GeForce 400 and 500 series).
ru: Видеокарта NVIDIA архитектуры Kepler или более новой (серия GeForce 600 и новее). На свой страх и риск вы можете попробовать данный плагин вместе с видеокартами архитектуры Fermi (серии GeForce 400 и 500).

source: NVIDIA proprietary drivers installed in any way available:
ru: Проприетарные драйвера NVIDIA, установленные любым доступным способом:

source: Official website:
ru: Официальный сайт:

source: Package manager or other system utilities (for example, Driver Manager in Ubuntu).
ru: Пакетный менеджер или другие системные утилиты (например, Driver Manager в Ubuntu).

source: The NVIDIA X Server Settings program that is available via the "nvidia-settings" command (i.e. the program must be located in one of the $PATH directories).
ru: Программа NVIDIA X Server Settings, доступная через команду "nvidia-settings" (т.е. программа должна находиться в одной из директорий $PATH).

source: An NVIDIA X Configuration Tool application that can be accessed via the "nvidia-xconfig" command (i.e. the program must be located in one of the $PATH directories).
ru: Программа NVIDIA X Configuration Tool, достапная через команду "nvidia-xconfig" (т.е. программа должна находиться в одной из директорий $PATH).

source: Fan control enabled. This is done by setting the second bit of the CoolBits variable to Xorg.conf. More information about CoolBits can be found here: `<https://wiki.archlinux.org/index.php/NVIDIA/Tips_and_tricks#Enabling_overclocking>`_. The easiest way to set the second bit in CoolBits: ``sudo nvidia-xconfig --cool-bits=4``. After that it is necessary to reboot the computer.
ru: Включённая возможность контроля вентиляторов. Это делается установкой второго бита переменной CoolBits в Xorg.conf. Более подробно про CoolBits можно найти здесь: `<https://wiki.archlinux.org/index.php/NVIDIA/Tips_and_tricks_(Русский)#Включение_разгона>`_. Самый простой способ установить второй бит в CoolBits: ``sudo nvidia-xconfig --cool-bits=4``. После этого необходимо перезагрузить компьютер.

source: Plugin functions
ru: Функции плагина

source: The nvidia-nvml plugin contains one function that can be run from the :doc:`script </user/modes/script>` through :ref:`$.dev.customFunction <script-ref-dev-customFunction>`:
ru: Плагин nvidia-nvml содержит одну функцию, которую можно запускать из :doc:`скрипта </user/modes/script>` через :ref:`$.dev.customFunction <script-ref-dev-customFunction>`:

source: Gives reasons for the throttling of the video card. The result of the function is an object that contains throttling reason IDs as keys. Each field is an integer value. Each field can have one of two values:
ru: Выдаёт причины троттлинга видеокарты. Результат функции - объект, содержащий в качестве ключей идентификаторы причины троттлинга. Каждое поле представляет собой целочисленное значение. Каждое поле может иметь одно из двух значений:

source: **Zero** - throttling, if exists, is not caused by this reason.
ru: **ноль** - троттлинг, если он имеется, не вызван этой причиной.

source: **Cause code** - throttling is caused by this reason.
ru: **код причины** - троттлинг вызван данной причиной.

source: Possible string values:
ru: Возможные значения строк:

source: **gpuIdle** - the frequency of the GPU is reduced because no tasks are running on the GPU.
ru: **gpuIdle** - частота GPU уменьшена, т.к. на GPU не запущено никаких задач.

source: **applicationsClocksSetting** - the frequency of the GPU is limited by the general frequency setting for applications.
ru: **applicationsClocksSetting** - частота GPU ограничена общей настройкой частоты для приложений.

source: **swPowerCap** - the power-scaling algorithm lowers the GPU frequency.
ru: **swPowerCap** - power-scaling алгоритм занижает частоту GPU.

source: **hwSlowdown** - hardware-initiated slowdown; reasons can be different:
ru: **hwSlowdown** - замедление по требованию оборудования; причины могут быть разные:

source: the temperature is too high
ru: слишком высокая температура

source: the current is too high
ru: слишком высокий ток

source: PCIe bus or power supply throttling
ru: троттлинг шины PCIe или блока питания

source: GPU is in a process of switching frequencies or power modes
ru: GPU в процессе переключения частот или режимов питания

source: **syncBoost** - the video card is placed in the "Sync boost" group. All video cards in this group have the same maximum frequency. The **syncBoost** flag indicates that other video cards in this group slow down this video card.
ru: **syncBoost** - видеокарта помещена в группу "Sync boost". Все видеокарты в такой группе имеют одну и ту же максимальную частоту. Флаг **syncBoost** говорит о том, что другие видеокарты в этой группе тормозят данную видеокарту.

source: **swThermalSlowdown** - driver-initiated frequency reduction due to high GPU or memory temperature.
ru: **swThermalSlowdown** - понижение частоты по требованию драйвера из-за высокой температуры GPU или памяти.

source: **hwThermalSlowdown** - hardware-initiated frequency reduction due to high temperature.
ru: **hwThermalSlowdown** - понижение частоты по требованию оборудования из-за высокой температуры.

source: **hwPowerBrakeSlowdown** - PCIe bus or power supply throttling.
ru: **hwPowerBrakeSlowdown** - троттлинг шины PCIe или блока питания.

source: **unknown** - the throttling is detected, but the reason couldn't be determined.
ru: **unknown** - троттлинг имеется, но причину выяснить не удалось.

source: **code** - code of reasons of throttling, which is a logical OR all the IDs of individual reasons of throttling mentioned above. If this field is zero, there is no throttling.
ru: **code** - код причин троттлинга, представляющий собой логическое ИЛИ всех кодов отдельных причин троттлинга, указанных выше. Если это поле равно нулю, то троттлинг отсутствует.

source: const reasons = $.dev.customFunction('getThrottleReasons') if(reasons.swThermalSlowdown || reasons.hwThermalSlowdown) console.log(`Throttling because of the high temperature! Code: 0x${reasons.code.toString(16)}`)
ru: const reasons = $.dev.customFunction('getThrottleReasons') if(reasons.swThermalSlowdown || reasons.hwThermalSlowdown) console.log(`Троттлинг из-за высокой температуры! Код: 0x${reasons.code.toString(16)}`)

source: This plugin can be used to test the rules for controlling video card fans. The plugin creates a virtual video card, and also allows you to arbitrarily adjust its temperature.
ru: Данный плагин может использоваться для тестирования правил управления вентиляторами видеокарты. Плагин создаёт виртуальную видеокарту, а также даёт возможность произвольно регулировать её температуру.

source: External resources
ru: Сторонние ресурсы
