Repository: alkatrazstudio/gpu-fan-meister
Catalog: docs/src/locale/*/LC_MESSAGES/user.po
Languages: ru

source: If **true**, the fans are controlled by the application. If **false** - the fans are controlled by the GPU.
ru: Если **true**, то вентиляторами управляет программа. Если **false** - вентиляторами управляет GPU.

source: The fan speed the current mode wants to set. Unlike $.dev.fanSpeed, it can take :ref:`$.dev.FAN_SPEED_GPU <script-ref-dev-fanSpeedGpu>` and :ref:`$.dev.FAN_SPEED_NO_CHANGE <script-ref-dev-fanSpeedNoChange>` values.
ru: Скорость вентиляторов, которую хочет установить текущий режим. В отличие от $.dev.fanSpeed, может принимать значения :ref:`$.dev.FAN_SPEED_GPU <script-ref-dev-fanSpeedGpu>` и :ref:`$.dev.FAN_SPEED_NO_CHANGE <script-ref-dev-fanSpeedNoChange>`.

source: Current :doc:`mode <../../modes>` for the current video card.
ru: Текущий :doc:`режим <../../modes>` программы для данной видеокарты.

source: Possible values
ru: Возможные значения

source: Value
ru: Значение

source: Corresponding constant
ru: Соответствующая константа

source: Mode
ru: Режим

source: :doc:`Curve <../curve>`
ru: :doc:`Кривая <../curve>`

source: :doc:`Fan toggle <../fanToggle>`
ru: :doc:`Вкл./выкл. вентиляторов <../fanToggle>`

source: :doc:`Script <../script>`
ru: :doc:`Скрипт <../script>`

source: :doc:`GPU controlled <../gpu>`
ru: :doc:`Под управлением GPU <../gpu>`

source: if($.dev.mode == $.dev.MODE_CURVE) console.log('We are in the "Curve" mode now')
ru: if($.dev.mode == $.dev.MODE_CURVE) console.log('Сейчас мы в режиме "Кривая"')

source: Percentage of time in the last sampling period (usually 1 second) during which at least one GPU core has been used. If :ref:`$.dev.plugin.canGetGpuRate <script-ref-dev-plugin-canGetGpuRate>` = **false**, this value is always zero.
ru: Процент времени за последний период семплирования (как правило 1 секунда), в течение которого было задействовано хотя бы одно ядро GPU процессора. Если :ref:`$.dev.plugin.canGetGpuRate <script-ref-dev-plugin-canGetGpuRate>` = **false**, то это значение всегда равно нулю.

source: console.log(`Processor ${$.dev.name} load is ${$.dev.gpuRate}%`)
ru: console.log(`Процессор ${$.dev.name} загружен на ${$.dev.gpuRate}%`)

source: Percentage of time in the last sampling period (typically 1 second) during which GPU memory was read or written. If :ref:`$.dev.plugin.canGetMemoryRate <script-ref-dev-plugin-canGetMemoryRate>` = **false**, this value is always zero.
ru: Процент времени за последний период семплирования (как правило 1 секунда), в течение которого осуществлялись чтение или запись памяти GPU. Если :ref:`$.dev.plugin.canGetMemoryRate <script-ref-dev-plugin-canGetMemoryRate>` = **false**, то это значение всегда равно нулю.

source: console.log(`Memory ${$.dev.name} load is ${$.dev.memoryRate}%`)
ru: console.log(`Память ${$.dev.name} загружена на ${$.dev.memoryRate}%`)

source: Total amount of memory in bytes. If :ref:`$.dev.plugin.canGetTotalMemory <script-ref-dev-plugin-canGetTotalMemory>` = **false**, this value is always zero.
ru: Общее кол-во памяти в байтах. Если :ref:`$.dev.plugin.canGetTotalMemory <script-ref-dev-plugin-canGetTotalMemory>` = **false**, то это значение всегда равно нулю.

source: Total amount of free memory in bytes. If :ref:`$.dev.plugin.canGetFreeMemory <script-ref-dev-plugin-canGetFreeMemory>` = **false**, this value is always zero.
ru: Общее кол-во свободной памяти в байтах. Если :ref:`$.dev.plugin.canGetFreeMemory <script-ref-dev-plugin-canGetFreeMemory>` = **false**, то это значение всегда равно нулю.

source: Functions for working with GPU
ru: Функции для работы с GPU

source: Download previously saved general video card settings.
ru: Загрузить ранее сохранённые общие настройки видеокарты.

source: Save the general application settings to a file.
ru: Сохранить в файл общие настройки приложения.

source: Restore application mode settings. These settings are located in the tabs of the main program window. Execution of this function is equivalent to pressing the "Cancel" button in this window, but only without closing the window later.
ru: Загрузить настройки режимов приложения. Эти настройки находятся на вкладках основного окна программы. Выполнение данной функции равносильно нажатию кнопки "Отмена" в этом окне, но только без последующего закрытия окна.

source: Save the application mode settings. These settings are located in the tabs of the main program window. Execution of this function is equal to pressing the "Save" button in this window, but only without closing the window later.
ru: Сохранить настройки режимов приложения. Эти настройки находятся на вкладках основного окна программы. Выполнение данной функции равносильно нажатию кнопки "Сохранить" в этом окне, но только без последующего закрытия окна.

source: Launches new script with a source code from **$.dev.scriptText**. The current script will be run to the end and then stopped.
ru: Запускает новый скрипт на основе текста из **$.dev.scriptText**. При этом текущий скрипт будет выполнен до конца, а затем остановлен.

source: Stops the current script after it has been executed to the end.
ru: Останавливает текущий скрипт после того, как он быдет выполнен до конца.

source: Show system notification with text **msg**. If **isCritical** = **true**, the message is set to a higher priority (the system will decide how this affects the shown notification).
ru: Показать системное уведомление с текстом **msg**. Если **isCritical** = **true**, то у сообщения устанавливается повышенный приоритет (то, как это повлияет на отображение уведомления, будет решать система).

source: Depending on the operating system and its version, system notifications may support some HTML tags, such as &lt;b> or &;lti>, as well as links &lt;a>.
ru: В зависимости от операционной системы и ей версии, системные уведомления могут поддерживать некоторые теги HTML, например &lt;b> или &;lti>, а также ссылки &lt;a>.

source: // Displaying a message with higher priority $.dev.showNotification('Your video card will melt soon!', true) // Showing HTML messages // (may not work or may not show what is needed on some platforms) $.dev.showNotification( 'Here is <a href="https://example.com/">one <i>good</i> example</a>.')
ru: // Показ сообщения с повышенным приоритетом $.dev.showNotification('Ваша видеокарта скоро расплавится!', true) // Показ HTML-сообщения // (может не работать или показывать не то, что нужно, на некотрых платформах) $.dev.showNotification( 'Вот вам <a href="https://example.com/">один <i>хороший</i> пример</a>.')

source: Start the **name** function for this device and return the result. Any value **val** can be optionally passed to the function. The list of available functions can be obtained through the property :ref:`$.dev.plugin.customFunctions <script-ref-dev-plugin-customFunctions>`.
ru: Запустить функцию **name** для данного устройства и вернуть результат. В функцию можно любое значение **val**, а можно не передавать. Список доступных функций можно получить через свойство :ref:`$.dev.plugin.customFunctions <script-ref-dev-plugin-customFunctions>`.

source: // Example of a function call from nvidia-nvml plugin const reasons = $.dev.customFunction('getThrottleReasons') if(reasons.swThermalSlowdown || reasons.hwThermalSlowdown) console.log(`Throttling because of the high temperature! Code: 0x${reasons.code.toString(16)}`)
ru: // Пример вызова функции из плагина nvidia-nvml const reasons = $.dev.customFunction('getThrottleReasons') if(reasons.swThermalSlowdown || reasons.hwThermalSlowdown) console.log(`Троттлинг из-за высокой температуры! Код: 0x${reasons.code.toString(16)}`)

source: General settings for the video card
ru: Общие настройки для видеокарты

source: The name of the GPU specified by the user.
ru: Заданное пользователем название GPU.

source: If the current temperature of the video card (in degrees Celsius) is less than **$.dev.tempWarning**, the number in the tray icon indicating the temperature will be **$.dev.colorTempNormal**. If the temperature is greater than or equal to **$.dev.tempWarning**, but not greater than **$.dev.tempDanger**, the number will have the color **$.dev.colorTempWarning**. If the temperature is greater than or equal to **$.dev.tempDanger**, the number will have the color **$.dev.colorTempDanger**. For more information about the **ColorString** data type see ":ref:`script-ref-tools`".
ru: Если текущая температура видеокарты (в градусах Цельсия) меньше, чем **$.dev.tempWarning**, то число в иконке из трея, обозначающее температуру, будет иметь цвет **$.dev.colorTempNormal**. Если температура больше или равна **$.dev.tempWarning**, но не больше, чем **$.dev.tempDanger**, то число будет иметь цвет **$.dev.colorTempWarning**. Если температура больше или равна **$.dev.tempDanger**, то число будет иметь цвет **$.dev.colorTempDanger**. Подробнее о типе данных **ColorString** читайте в разделе ":ref:`script-ref-tools`".

source: If the speed of the video card fans (in the range from 0 to 100) is less than **$.dev.fanSpeedWarning**, the tray icon border will be **$.dev.colorFanSpeedNormal**. If the speed is greater than or equal to **$.dev.fanSpeedWarning**, but no more than **$.dev.fanSpeedDanger**, the border will have the color **$.dev.colorFanSpeedWarning**. If the speed is greater than or equal to **$.dev.fanSpeedDanger**, the border will have the color **$.dev.colorFanSpeedDanger**. For more information about the **ColorString** data type see ":ref:`script-ref-tools`".
ru: Если скорость вентиляторов видеокарты (в диапазоне от 0 до 100) меньше, чем **$.dev.fanSpeedWarning**, то рамка иконки в трее будет иметь цвет **$.dev.colorFanSpeedNormal**. Если скорость больше или равна **$.dev.fanSpeedWarning**, но не больше, чем **$.dev.fanSpeedDanger**, то рамка будет иметь цвет **$.dev.colorFanSpeedWarning**. Если скорость больше или равна **$.dev.fanSpeedDanger**, то рамка будет иметь цвет **$.dev.colorFanSpeedDanger**. Подробнее о типе данных **ColorString** читайте в разделе ":ref:`script-ref-tools`".

source: The background color of the tray icon.
ru: Цвет фона иконки в трее.

source: The minimum tray update interval for this video card. Measured in seconds.
ru: Минимальный интервал обновления данных в трее для данной видеокарты. Измеряется в секундах.

source: "Curve" mode settings
ru: Настройки режима "Кривая"

source: These settings apply to the ":doc:`../curve`" mode.
ru: Данные настройки относятся к режиму ":doc:`../curve`".

source: Stores an array of curve points. The array is represented by the standard **Array** type. Each point is an object with **x** and **y** properties, where **x** is the temperature in degrees Celsius, **y** is the speed of the fans in the range from 0 to 100 inclusive. The contents of this array cannot be changed directly. Instead, you need to create a copy using the :ref:`$.tools.clone <script-ref-tools-clone>` function, change this copy, and then assign this copy to the **$.dev.curvePoints** array. After modifying **$.dev.curvePoints** all the data in it will be normalized relative to the chart boundaries, so the data assigned to this array may differ from the data that will actually be there afterwards.
ru: Хранит массив точек кривой. Массив представлен стандартным типом **Array**. Каждая точка представляет собой объект со свойствами **x** и **y**, где **x** - температура в градусах Цельсия, **y** - скорость вентиляторов в диапазоне от 0 до 100 включительно. Содержимое данного массива нельзя менять напрямую. Вместо этого необходимо создать его копию с помощью функции :ref:`$.tools.clone <script-ref-tools-clone>`, изменить эту копию, а затем присвоить массиву **$.dev.curvePoints** эту копию. После изменения **$.dev.curvePoints** все данные в нём будут нормализованы относительно границ графика, поэтому записанные в этот массив данные могут отличаться от тех данных, которые реально там окажутся в конечном итоге.

source: // increase the fan speed for the penultimate point var pts = $.tools.clone($.dev.curvePoints) pts[pts.length-2].y +=10 $.dev.curvePoints = pts // set a new set of points $.dev.curvePoints = [ {x: 0, y: 0, {x: 60, y: 0}, {x: 100, y: 50} ] // attempt to set an incorrect set of points $.dev.curvePoints = [ {x: 20, y: 30}, 50, bogus: 123}, {x: 100, y: -10} ] $.dev.curvePoints // [{x: 0, y: 30}, {x: 50, y: 0}, {x: 100, y: 0}]
ru: // увеличить скорость вентиляторов для предпоследней точки var pts = $.tools.clone($.dev.curvePoints) pts[pts.length-2].y += 10 $.dev.curvePoints = pts // задать новый набор точек $.dev.curvePoints = [ {x: 0, y: 0}, {x: 60, y: 0}, {x: 100, y: 50} ] // попытка задать некорректный набор точек $.dev.curvePoints = [ {x: 20, y: 30}, {x: 50, bogus: 123}, {x: 100, y: -10} ] $.dev.curvePoints // [{x: 0, y: 30}, {x: 50, y: 0}, {x: 100, y: 0}]

source: The value of ":ref:`Max inc. temp. diff. <curve-maxIncTempDiff>`".
ru: Значение параметра ":ref:`Макс. увел. темп. <curve-maxIncTempDiff>`".

source: The value of the ":ref:`Inc. delay <curve-incDelay>`" parameter.
ru: Значение параметра ":ref:`Задержка увел. <curve-incDelay>`".

source: The value of ":ref:`Max inc. temp. diff. <curve-maxDecTempDiff>`" parameter.
ru: Значение параметра ":ref:`Макс. уменьш. темп. <curve-maxDecTempDiff>`".

source: The value of the ":ref:`Dec. delay <curve-decDelay>`" parameter.
ru: Значение параметра ":ref:`Задержка уменьш. <curve-decDelay>`".

source: The temperature that is used to calculate the required fan speed according to the curve. See ":ref:`curve-hysteresis`", where this temperature is indicated as |T1|.
ru: Температура, которая используется для расчёта требуемой скорости вентиляторов по графику. См. раздел ":ref:`curve-hysteresis`", там эта температура обозначена как |T1|.

source: "Fan toggle" mode settings
ru: Настройки режима "Вкл./выкл. вентиляторов"

source: These settings refer to the ":doc:`../fanToggle`" mode.
ru: Данные настройки относятся к режиму ":doc:`../fanToggle`".

source: Fans will be enabled if the temperature of the video card is equal or higher than this value for :ref:`fanToggleEnableFansTempSecs <script-ref-dev-fanToggleEnableFansTempSecs>` seconds.
ru: Вентиляторы включатся, если температура видеокарты будет равна или больше данного значения на протяжении :ref:`fanToggleEnableFansTempSecs <script-ref-dev-fanToggleEnableFansTempSecs>` секунд.

source: Time in seconds after which the fans will be enabled if the temperature has been at least :ref:`fanToggleEnableFansTemp <script-ref-dev-fanToggleEnableFansTemp>` all this time.
ru: Время в секундах, после которого включаются вентиляторы, если температура всё это время была как минимум :ref:`fanToggleEnableFansTemp <script-ref-dev-fanToggleEnableFansTemp>`.

source: Enable the rule that disable the fans if their speed does not exceed :ref:`fanToggleLowFanSpeed <script-ref-dev-fanToggleLowFanSpeed>` for :ref:`fanToggleLowFanSpeedSecs <script-ref-dev-fanToggleLowFanSpeedSecs>` seconds.
ru: Включить правило, по которому вентиляторы будут отключаться, если их скорость не будет превышать :ref:`fanToggleLowFanSpeed <script-ref-dev-fanToggleLowFanSpeed>` на протяжении :ref:`fanToggleLowFanSpeedSecs <script-ref-dev-fanToggleLowFanSpeedSecs>` секунд.

source: Fans will be disabled if their speed was less than or equal to this value during :ref:`fanToggleLowFanSpeedSecs <script-ref-dev-fanToggleLowFanSpeedSecs>` seconds. Applies only if :ref:`fanToggleUseLowFanSpeed <script-ref-dev-fanToggleUseLowFanSpeed>` = **true**.
ru: Вентиляторы отключатся, если их скорость была меньше или равна данного значения на протяжении :ref:`fanToggleLowFanSpeedSecs <script-ref-dev-fanToggleLowFanSpeedSecs>` секунд. Применяется только если :ref:`fanToggleUseLowFanSpeed <script-ref-dev-fanToggleUseLowFanSpeed>` = **true**.

source: Time in seconds after which the fans will be disabled if their speed does not exceed :ref:`fanToggleLowFanSpeed <script-ref-dev-fanToggleLowFanSpeed>`. Applies only if :ref:`fanToggleUseLowFanSpeed <script-ref-dev-fanToggleUseLowFanSpeed>` = **true**.
ru: Время в секундах, после которого вентиляторы отключатся, если их скорость всё это время не будет превышать :ref:`fanToggleLowFanSpeed <script-ref-dev-fanToggleLowFanSpeed>`. Применяется только если :ref:`fanToggleUseLowFanSpeed <script-ref-dev-fanToggleUseLowFanSpeed>` = **true**.

source: Enable the rule that disable the fans if the temperature of the video card does not exceed :ref:`fanToggleLowTemp <script-ref-dev-fanToggleLowTemp>` for :ref:`fanToggleLowTempSecs <script-ref-dev-fanToggleLowTempSecs>` seconds.
ru: Включить правило, по которому вентиляторы будут отключаться, если температура видеокарты не будет превышать :ref:`fanToggleLowTemp <script-ref-dev-fanToggleLowTemp>` на протяжении :ref:`fanToggleLowTempSecs <script-ref-dev-fanToggleLowTempSecs>` секунд.

source: The fans will be disabled if the temperature of the video card does not exceed this value for :ref:`fanToggleLowTempSecs <script-ref-dev-fanToggleLowTempSecs>` seconds. Applies only if :ref:`fanToggleUseLowTemp <script-ref-dev-fanToggleUseLowTemp>` = **true**.
ru: Вентиляторы отключатся, если температура видеокарты не будет превышать данного значения на протяжении :ref:`fanToggleLowTempSecs <script-ref-dev-fanToggleLowTempSecs>` секунд. Применяется только если :ref:`fanToggleUseLowTemp <script-ref-dev-fanToggleUseLowTemp>` = **true**.

source: Time in seconds after which the fans will be disabled if the temperature of the video card does not exceed :ref:`fanToggleLowTemp <script-ref-dev-fanToggleLowTemp>`. Applies only if :ref:`fanToggleUseLowTemp <script-ref-dev-fanToggleUseLowTemp>` = **true**.
ru: Время в секундах, после которого вентиляторы отключатся, если температура видеокарты всё это время не будет превышать :ref:`fanToggleLowTemp <script-ref-dev-fanToggleLowTemp>`. Применяется только если :ref:`fanToggleUseLowTemp <script-ref-dev-fanToggleUseLowTemp>` = **true**.

source: "Script" mode settings
ru: Настройки режима "Скрипт"

source: These settings refer to the ":doc:`../script`" mode.
ru: Данные настройки относятся к режиму ":doc:`../script`".

source: Script source code that is displayed in the editor. This text may not be the same as the text of the currently running script (see the next parameter).
ru: Текст скрипта, который отображается в редакторе. Этот текст может не совпадать с текстом запущенного на данный момент скрипта (см. след. параметр).

source: The source code of the script that was executed last time or is being executed now.
ru: Текст скрипта, который выполнялся последний раз или выполняется сейчас.

source: Enables the :ref:`"Override" <mode-script-override>` mode.
ru: Включает режим :ref:`"Переопределения" <mode-script-override>`.

source: The state of the script when the current step will be completed. It can be one of the following values:
ru: Состояние, которое примет скрипт по завершению текущего шага. Может принимать следующие значения:

source: Script is :ref:`stopped <mode-script-status-paused>`.
ru: Скприпт :ref:`остановлен <mode-script-status-paused>`.

source: Script is :ref:`paused <mode-script-status-paused>`.
ru: Скприпт :ref:`на паузе <mode-script-status-paused>`.

source: The script is :ref:`running <mode-script-status-running>`.
ru: Скрипт :ref:`запущен <mode-script-status-running>`.

source: if($.dev.scriptStatus == $.dev.SCRIPT_STATUS_STOPPED) console.log('The script will be stopped after the current step')
ru: if($.dev.scriptStatus == $.dev.SCRIPT_STATUS_STOPPED) console.log('Скрипт будет остановлен после текущего шага')

source: Current error that occurred in the script. Though this property is accessible through a script, for a script it will always be an empty string because the script cannot be started in the presence of errors. This property is used only in internal scripts of the application.
ru: Текущая ошибка, которая произошла в скрипте. Хоть это свойство и доступно через скрипт, но для скрипта оно будет всегда равно пустой строке, т.к. скрипт не может быть запущен при наличии ошибок. Это свойство используется исключительно во внутренних скриптах программы.

source: GPU plugin info
ru: Данные о плагине для GPU

source: Plugin category. Denotes the class of the GPU that the plugin works with. In |project| more than one plugin from a single category cannot be loaded simultaneously .
ru: Категория плагина. Обозначает класс GPU, с которыми работает плагин. В |project| не может быть загружено одновременно более одного плагина из отдельно взятой категории.

source: *Example:* ``"nvidia"``
ru: *Пример:* ``"nvidia"``

source: Unique plugin identifier.
ru: Уникальный идентификатор плагина.

source: *Example:* ``"nvidia-nvml"``
ru: *Пример:* ``"nvidia-nvml"``

source: Plugin name.
ru: Название плагина.

source: *Example:* ``"NVIDIA (NVML)"``
ru: *Пример:* ``"NVIDIA (NVML)"``

source: Plugin description.
ru: Описание плагина.

source: *Example:* ``"NVIDIA video card plugin using NVML library."``
ru: *Пример:* ``"Плагин для видеокарт NVIDIA, использующий библиотеку NVML."``

source: Information about the authors of the plugin.
ru: Информация об авторах плагина.

source: *Example:* ``"Alkatraz Studio, 2018"``
ru: *Пример:* ``"Alkatraz Studio, 2018"``

source: Any other information about the plugin that is not suitable for other fields.
ru: Любая другая информация о плагине, не подходящая для других полей.

source: *Example:* ``"Project site: https://example.com\nEmail: user@example.com"``
ru: *Пример:* ``"Сайт проекта: https://example.com\nПочта: user@example.com"``

source: Plugin version in the `SemVer <https://semver.org>`_ format.
ru: Версия плагина в формате `SemVer <https://semver.org/lang/ru/>`_.

source: *Example:* ``"1.0.5"``
ru: *Пример:* ``"1.0.5"``

source: Major version of the plugin. For example, for version **1.0.5** the major version will be **1**. Read more about versioning at `SemVer <https://semver.org>`_.
ru: Мажорная версия плагина. Например, для версии **1.0.5** мажорная версия будет равна **1**. Подробнее о системе нумерации версий см. `SemVer <https://semver.org/lang/ru/>`_.

source: Minor version of the plugin. For example, for version **1.0.5**, the minor version will be **0**. Read more about versioning at `SemVer <https://semver.org>`_.
ru: Минорная версия плагина. Например, для версии **1.0.5** минорная версия будет равна **0**. Подробнее о системе нумерации версий см. `SemVer <https://semver.org/lang/ru/>`_.

source: Patch version of the plugin. For example, for version **1.0.5** the patch version will be **5**. Read more about versioning at `SemVer <https://semver.org>`_.
ru: Патч-версия плагина. Например, для версии **1.0.5** патч-версия будет равна **5**. Подробнее о системе нумерации версий см. `SemVer <https://semver.org/lang/ru/>`_.

source: Plugin build date and time. If this information is not available, the "Invalid Date" object is returned.
ru: Дата и время сборки плагина. Если эта информация не доступна, то возвращается объект "Invalid Date".

source: if(isNaN($.dev.plugin.buildDate)) console.log('Plugin build date is unavailable') else console.log(`Plugin build date: ${$.dev.plugin.buildDate}`)
ru: if(isNaN($.dev.plugin.buildDate)) console.log('Дата сборки плагина недоступна') else console.log(`Дата сборки плагина: ${$.dev.plugin.buildDate}`)

source: The number of video cards the plugin found in the system.
ru: Кол-во видеокарт, которые плагин нашёл в системе.

source: If **true**, the field :ref:`$.dev.gpuRate <script-ref-dev-gpuRate>` contains correct data.
ru: Если **true**, то поле :ref:`$.dev.gpuRate <script-ref-dev-gpuRate>` содержит правильные данные.

source: If **true**, the field :ref:`$.dev.memoryRate <script-ref-dev-memoryRate>` contains correct data.
ru: Если **true**, то поле :ref:`$.dev.memoryRate <script-ref-dev-memoryRate>` содержит правильные данные.
